/*!
  @file shading.fp
	
  @brief GLSLフラグメントシェーダ
 
  @author Makoto Fujisawa
  @date 2011
*/
// FILE --shading.fp--
#version 150 core

//-----------------------------------------------------------------------------
// 変数
//-----------------------------------------------------------------------------
// GLから設定される定数(uniform)
uniform vec3 color;	// 描画色
//uniform sampler2D tex;	// 表面テクスチャ

out vec4 fragcolor;

//-----------------------------------------------------------------------------
// エントリ関数
//-----------------------------------------------------------------------------
void main(void)
{	
	fragcolor = vec4(color, 1.0);
}

